LEXICON: dict = {
    'menu_questions': 'Меню вопросов',
    'start': 'Начать',
    'back': 'Назад',
    'ktep': 'Официальный сайт КТЭП',
    'ktep_link': 'https://ktep40.ru/',
    'menu': 'Меню \U000021A9',
    'your_role': 'Выбор роли',
    'statement': 'Информация для абитуриента',
    'schedule': 'Тип Расписания',
    'no_admin_or_unknown': "❌ Вы не являетесь администратором или ввели несуществующую команду",
    'error_start': 'Нажмите кнопку Начать',

}
LEXICON_schedule = {
    'schedule': 'Расписание',
    'call_schedule': 'Расписание звонков',
}

LEXICON_schedule_ans = {
    'call_schedule_ans': 'Текущее расписание звонков',
    '1_course_ans': 'Расписание звонков для 1-го курса',
    '2_course_ans': 'Расписание звонков для 2-го курса',
    '3_course_ans': 'Расписание звонков для 3-го курса',
    '4_course_ans': 'Расписание звонков для 4-го курса',
    '5_course_ans': 'Расписание звонков для 5-го курса',
}

LEXICON_admin_kb = {
    'add_admin': 'Добавить администратора',
    'replace_photo': 'Изменить нужное фото'
}
LEXICON_courses = {
    '1_course': '1-й курс',
    '2_course': '2-й курс',
    '3_course': '3-й курс',
    '4_course': '4-й курс',
    '5_course': '5-й курс',

}

LEXICON_roles = {
    'student': 'Студент',
    'incoming_student': 'Абитуриент',
    'admin': 'Администратор',
}

LEXICON_incoming_student = {
    'admission_plan': 'План поступления',
    'statement': 'Как представить заявление \U00002709',
    'documents': 'Документы, необходимые для поступления \U0001F4EA',
    'deadline': 'Сроки подачи документов \U0001F4EB',
    'questions': 'Если остались вопросы \U0000260E',
}

LEXICON_incoming_student_ans = {
    'admission_plan_ans': 'Что вас интересует ?',
    'statement_ans': 'Лично в Техникуме\n'
                     ' \U00002709 Через операторов почтовой связи заказным письмом с уведомлением о вручении\n'
                     ' \U0001F4EE Посредством электронной почты uchast.ktep@gmail.com\n'
                     '\U0001F4F1 С помощью использования функционала Единый портал государственных и муниципальных '
                     'услуг',
    'documents_ans': 'Вам нужно:\n'
                     '1) Заявление поступающего\n'
                     '2) Оригинал или ксерокопию паспорта поступающего\n'
                     '3) СНИЛС поступающего\n'
                     '4) Оригинал или ксерокопия аттестата об основном общем образовании\n'
                     '5) Фотографии размером 3х4 (4штуки)\n'
                     '6) Медицинская справка формы 086-у\n'
                     '7) Согласие родителей на обработку персональных данных ребенка\n'
                     '8) Согласие родителей на видеонаблюдение\n'
                     '9) Согласие родителей на обработку персональных данных ребенка третьими лицами '
                     '(централизованная бухгалтерия)\n'
                     '\nА так-же',
    'deadline_ans': '\U000026A0Прием документов на первый курс очного отделения осуществляется '
                    'с 19 июня до 15 августа,\n'
                    ' а при наличии свободных мест прием документов продлевается до 25 ноября\U000026A0',
    'questions_ans': 'Позвоните 8(4842)73-71-01'

}
LEXICON_prof = {
    '09.02.01': "09.02.01 КСК",
    '09.02.06': "09.02.06 Сисадмин",
    '09.02.07': "09.02.07 ИсиП(п)",
    '09.02.07(t)': "09.02.07(t) ИСиП(т)",
    '10.02.04': "10.02.04 ИБ",
    '11.02.13': "11.02.13 ТЭ",
    '11.02.16': "11.02.16 МТОР",
}

LEXICON_admin = {
    'how_to_add_admin': 'Отправьте id пользователя, которого хотите добавить\n'
                        'Например: id123456789 \n'
                        'Или ссылку в формате https://vk.com/id\n'
                        '\n'
                        'id должен быть длинной от 5 до 32 символов',
    'error_admin_template': '❌Неправильный шаблон для добавления админа\n'
                            'или такого пользователя не существует\n'
                            '\n'
                            '\n id должен быть длинной от 5 до 32 символов'
                            '\n'
                            'Попробуйте ещё раз',
    'admin_added': '✅ Администратор был успешно добавлен',
    'admin_in_base': '✅ Данный Администратор уже в базе',
    'check_photo': 'Выберите, какое фото вы хотите изменить или проверить',
    'add_photo': '📷 Отправьте боту фото, которое хотите вставить вместо выбранного',
    'photo_added': '✅ Фото успешно добавлено',
    'photo_update': '✅ Фото успешно обновлено',
    'error_replace_photo': '❌ Ошибка изменения фото'
                           '\n'
                           'Пожалуйста, отправьте фото ещё раз'
}

LEXICON_prof_ans = {
    '09.02.01': 'По специальности 09.02.01 Компьютерные системы и комплексы техникум готовит техника '
                'по компьютерным системам, который проектирует, конструирует, настраивает, обслуживает'
                ' компьютерные сети, средства вычислительной техники, мониторы, принтеры, сканеры и др.\n\n'
                'Предприятия: АО "Тайфун", АО "Калуга Астрал", КФ ПАО "Ростелеком", ПАО "Сбербанк".\n\n'
                'Специалист в этой области знает устройство плат, микропроцессоров\n\n'
                'Источник: https://ktep40.ru/spetsialnosti/09-02-01-kompyuternye-sistemy-i-kompleksy/',
    '09.02.06': 'По специальности 09.02.06 Сетевое и системное администрирование техникум готовит техника,'
                ' который выполняет работы по проектированию сетевой инфраструктуры, сетевому администрированию,'
                ' эксплуатации объектов сетевой инфраструктуры.\n\n'
                'Сетевой и системный администратор (он же IT-администратор, сисадмин) – это специалист,'
                ' который обеспечивает штатную работу парка компьютерной техники в компании или организации,'
                ' правильную работу компьютерной сети и имеющегося программного обеспечения,'
                ' а также отвечает за информационную безопасность организации.\n\n'
                'Предприятия: АО "Тайфун", АО "Калуга Астрал", КФ ПАО "Ростелеком", ПАО "Сбербанк"\n\n'
                'Источник:https://ktep40.ru/spetsialnosti/09-02-06-setevoe-i-sistemnoe-administrirovanie/',

    '09.02.07': 'По специальности 09.02.07 Информационные системы и программирование техникум готовит программистов,'
                'который принимает участие в разработке, отладке, проверке работоспособности,'
                ' модификации программного обеспечения.\n\n'
                'Предприятия: АО "Тайфун", АО "Калуга Астрал", КФ ПАО "Ростелеком",'
                ' ООО "Каскад инжиниринг", ООО "АйТи-комплекс", ПАО "Сбербанк"\n\n'
                'Специалист может выполнять следующие виды деятельности:'
                '\n- разработка модулей программного обеспечения для компьютерных систем;'
                '\n- осуществление интеграции программных модулей;'
                '\n- сопровождение и обслуживание программного обеспечения компьютерных систем'
                '\n- разработка, администрирование и защита баз данных.\n\n'
                'Источник:'
                'https://ktep40.ru/spetsialnosti/09-02-07-informatsionnye-sistemy-i-programmirovanie-programmist/',
    '09.02.07(t)': 'По специальности 09.02.07 Информационные системы и программирование техникум готовит специалистов'
                   ' по тестированию в области информационных технологий\n\n'
                   'Предприятия: АО "Тайфун", АО "Калуга Астрал", КФ ПАО "Ростелеком",'
                   ' ООО "Каскад инжиниринг", ООО "АйТи-комплекс", ПАО "Сбербанк"\n\n'
                   'Специалист может выполнять следующие виды деятельности:'
                   '\n- разработка модулей программного обеспечения для компьютерных систем;'
                   '\n- осуществление интеграции программных модулей;'
                   '\n- сопровождение и обслуживание программного обеспечения компьютерных систем;'
                   '\n- разработка, администрирование и защита баз данных.\n\n'
                   'Источник:'
                   'https://ktep40.ru/spetsialnosti/09-02-07-informatsionnye-sistemy-i-programmirovanie-spetsialist-po-testirovaniyu-v-oblasti-informats/',
    '10.02.04': 'Специальность - 10.02.04 Обеспечение информационной безопасности телекоммуникационных систем.\n\n'
                'Область профессиональной деятельности выпускников:'
                '\n-обеспечение безопасности информации в компьютерных системах '
                'и сетях в условиях существования угроз их информационной безопасности;'
                '\n-обеспечение защиты средств связи сетей электросвязи (СССЭ) от несанкционированного доступа к '
                'ним (НСД) в условиях существования угроз их информационной безопасности (ИБ);'
                '\n-повышение эффективности поддержки процессов принятия решений в государственных органах, '
                'обеспечивающих национальную безопасность, за счет создания и применения '
                'информационно-аналитических систем в защищенном исполнении (ИАС);'
                '\n-обеспечение безопасности информации в автоматизированных системах,'
                ' функционирующих в условиях существования угроз в информационной сфере и '
                'обладающих информационно- технологическими ресурсами, подлежащими защите;'
                '\n-предотвращение утечки информации ограниченного доступа по техническим каналам в результате '
                'несанкционированного доступа к информации и специальных воздействий на информацию '
                '(носители информации) в целях ее добывания, уничтожения, искажения и блокирования доступа к ней.\n\n'
                'Квалификация: техник по защите информацииn\n\n'
                'Источник:'
                'https://ktep40.ru/spetsialnosti/10-02-04-obespechenie-informatsionnoy-bezopasnosti-telekommunikatsionnykh-sistem/',
    '11.02.13': 'По специальности 11.02.13 Твердотельная электроника техникум готовит техника, который участвует в '
                'разработке технологических процессов, в монтаже, регулировке, техническом обслуживании и эксплуатации '
                'технологического оборудования для изготовления изделий твердотельной электроники.'
                '\n\nПредприятия: АО "Восход" - КРЛЗ, АО "ОКБ МЭЛ", ООО "СмартТермоэлектрикс", '
                'АО "Информтехника и Связь", ООО "Фокон".'
                '\n\nВыпускники участвуют в изготовлении микросхем различного типа для военной, космической, '
                'бытовой техники, компьютеров. Наши выпускники получают знания по основам проектирования '
                'интегральных микросхем, подробно изучают современное оборудование для изготовления этих микросхем.'
                '\n\nИсточник:https://ktep40.ru/spetsialnosti/11-02-13-tverdotelnaya-elektronika/',
    '11.02.16': 'По специальности 11.02.16 Монтаж, техническое обслуживание и ремонт электронных приборов и '
                'устройств техникум готовит техника, который участвует в конструировании и проектировании электронных '
                'приборов и устройств, в разработке базовых элементов для оснащения промышленных '
                'и бытовых вычислительных систем.'
                '\n\nПредприятия: АО "Тайфун", АО "Информтехника и Связь", АО "КЗТА", АО "Восход"-КРЛЗ, '
                'ООО "НПО "Телеметрия", ООО "Фокон", АО "КЭМЗ", АО "НПФ "Сигма", АО "Автоэлектроника",'
                ' АО "Калугаприбор"'
                '\n\nСоздание чертежей и технологий (техник-конструктор, техник-технолог), сборка, монтаж, '
                'регулировка изделий (слесарь-сборщик, электромонтажник, регулировщик), '
                'управляет производственным процессом (мастер производственного участка),'
                ' обслуживает оборудование и осуществляет контроль качества изделий '
                '(контролер, наладчик технологического оборудования).'
                '\n\n'
                'Источник:https://ktep40.ru/spetsialnosti/11-02-16-montazh-tekhnicheskoe-obsluzhivanie-i-remont-elektronnykh-priborov-i-ustroystv/',
}

LEXICON_photo_name = {
    '1_course': '1-й курс',
    '2_course': '2-й курс',
    '3_course': '3-й курс',
    '4_course': '4-й курс',
    '5_course': '5-й курс',
    'documents': 'Документы, необходимые для поступления \U0001F4EA',
    'call_schedule': 'Расписание звонков',
    'admission_plan': 'План поступления'
}
